# Overview

## Import package

In [209]:
import pandas as pd
import numpy as np
import sys
import mysql.connector
from sqlalchemy import create_engine
import matplotlib.pyplot as plt
import plotly.express as px
import plotly.io as pio
from plotly.subplots import make_subplots
import plotly.graph_objects as go
import plotly.figure_factory as ff
from plotly.offline import plot
import geopandas as gpd
import seaborn as sns
pio.renderers.default = 'iframe'

### Connect to db

In [210]:
mydb = mysql.connector.connect(
    host = "localhost",
    database='movie',
    user = "root",
    password = "12345678"
)

In [211]:
## create engine
engine = create_engine("mysql+pymysql://root:12345678@localhost/movie".format(host='localhost', db='movie', user="root", pw='12345678'))

            ADMIN ISO_A3                                           geometry
0           Aruba    ABW  POLYGON ((-69.99694 12.57758, -69.93639 12.531...
1     Afghanistan    AFG  POLYGON ((71.04980 38.40866, 71.05714 38.40903...
2          Angola    AGO  MULTIPOLYGON (((11.73752 -16.69258, 11.73851 -...
3        Anguilla    AIA  MULTIPOLYGON (((-63.03767 18.21296, -63.09952 ...
4         Albania    ALB  POLYGON ((19.74777 42.57890, 19.74601 42.57993...
..            ...    ...                                                ...
250         Samoa    WSM  MULTIPOLYGON (((-171.57002 -13.93816, -171.564...
251         Yemen    YEM  MULTIPOLYGON (((53.30824 12.11839, 53.31027 12...
252  South Africa    ZAF  MULTIPOLYGON (((37.86378 -46.94085, 37.83644 -...
253        Zambia    ZMB  POLYGON ((31.11984 -8.61663, 31.14102 -8.60619...
254      Zimbabwe    ZWE  POLYGON ((30.01065 -15.64623, 30.05024 -15.640...

[255 rows x 3 columns]

### Read CAV files

In [8]:
df_movie=pd.read_csv('movies_metadata.csv',low_memory=False)

In [69]:
df_cast_crew = pd.read_csv('credits.csv')

In [50]:
# Read GEO Json file 
world=gpd.read_file('countries.geojson')
world

            ADMIN ISO_A3                                           geometry
0           Aruba    ABW  POLYGON ((-69.99694 12.57758, -69.93639 12.531...
1     Afghanistan    AFG  POLYGON ((71.04980 38.40866, 71.05714 38.40903...
2          Angola    AGO  MULTIPOLYGON (((11.73752 -16.69258, 11.73851 -...
3        Anguilla    AIA  MULTIPOLYGON (((-63.03767 18.21296, -63.09952 ...
4         Albania    ALB  POLYGON ((19.74777 42.57890, 19.74601 42.57993...
..            ...    ...                                                ...
250         Samoa    WSM  MULTIPOLYGON (((-171.57002 -13.93816, -171.564...
251         Yemen    YEM  MULTIPOLYGON (((53.30824 12.11839, 53.31027 12...
252  South Africa    ZAF  MULTIPOLYGON (((37.86378 -46.94085, 37.83644 -...
253        Zambia    ZMB  POLYGON ((31.11984 -8.61663, 31.14102 -8.60619...
254      Zimbabwe    ZWE  POLYGON ((30.01065 -15.64623, 30.05024 -15.640...

[255 rows x 3 columns]

# Feature Observation

## Credits

### Consists of Cast and Crew Information for all our movies.

### 1. Cast: Information about Cast in movie

#### (1) cast_id
#### (2) character: Name of character
#### (3) credit_id
#### (4) gender: category datatype. 1=female 2=male
#### (5) id
#### (6) name: Name of cast
#### (7) order
#### (8) profile_path

### 2. Crew: Staff group information in movies

In [12]:
df_cast_crew = pd.read_csv('credits.csv')

In [13]:
df_cast_crew

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)',...","[{'credit_id': '52fe4284c3a36847f8024f49', 'de...",862
1,"[{'cast_id': 1, 'character': 'Alan Parrish', '...","[{'credit_id': '52fe44bfc3a36847f80a7cd1', 'de...",8844
2,"[{'cast_id': 2, 'character': 'Max Goldman', 'c...","[{'credit_id': '52fe466a9251416c75077a89', 'de...",15602
3,"[{'cast_id': 1, 'character': ""Savannah 'Vannah...","[{'credit_id': '52fe44779251416c91011acb', 'de...",31357
4,"[{'cast_id': 1, 'character': 'George Banks', '...","[{'credit_id': '52fe44959251416c75039ed7', 'de...",11862
...,...,...,...
45471,"[{'cast_id': 0, 'character': '', 'credit_id': ...","[{'credit_id': '5894a97d925141426c00818c', 'de...",439050
45472,"[{'cast_id': 1002, 'character': 'Sister Angela...","[{'credit_id': '52fe4af1c3a36847f81e9b15', 'de...",111109
45473,"[{'cast_id': 6, 'character': 'Emily Shaw', 'cr...","[{'credit_id': '52fe4776c3a368484e0c8387', 'de...",67758
45474,"[{'cast_id': 2, 'character': '', 'credit_id': ...","[{'credit_id': '533bccebc3a36844cf0011a7', 'de...",227506
45475,[],"[{'credit_id': '593e676c92514105b702e68e', 'de...",461257

#### (1) credit_id
#### (2) department: Employee's department: Directing,Writing,Crew, etc
#### (3) gender: Employee's gender
#### (4) id
#### (5) job: employee's job title
#### (6) name
#### (7) profile_path

## Movie Metadata

### The main Movies Metadata file. Contains information on 45,000 movies featured in the Full MovieLens dataset. Features include posters, backdrops, budget, revenue, release dates, languages, production countries and companies.

In [24]:
df_movie=pd.read_csv('movies_metadata.csv',low_memory=False)
pd.set_option('display.max_columns', None)

In [25]:
df_movie

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",21.946943,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,17.015539,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,"[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,11.7129,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg,"[{'name': 'Warner Bros.', 'id': 6194}, {'name'...","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92.0
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",3.859495,/16XOMpEaLWkrcPqSQqhTmeJuqQl.jpg,[{'name': 'Twentieth Century Fox Film Corporat...,"[{'iso_3166_1': 'US', 'name': 'United States o...",1995-12-22,81452156.0,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.1,34.0
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,8.387519,/e64sOI48hQXyru7naBFyssKFxVd.jpg,"[{'name': 'Sandollar Productions', 'id': 5842}...","[{'iso_3166_1': 'US', 'name': 'United States o...",1995-02-10,76578911.0,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.7,173.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45461,False,NaN,0,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",http://www.imdb.com/title/tt6209470/,439050,tt6209470,fa,رگ خواب,Rising and falling between a man and woman.,0.072051,/jldsYflnId4tTWPx8es3uzsB1I8.jpg,[],"[{'iso_3166_1': 'IR', 'name': 'Iran'}]",NaN,0.0,90.0,"[{'iso_639_1': 'fa', 'name': 'فارسی'}]",Released,Rising and falling between a man and woman,Subdue,False,4.0,1.0
45462,False,NaN,0,"[{'id': 18, 'name': 'Drama'}]",NaN,111109,tt2028550,tl,Siglo ng Pagluluwal,An artist struggles to finish his work while a...,0.178241,/xZkmxsNmYXJbKVsTRLLx3pqGHx7.jpg,"[{'name': 'Sine Olivia', 'id': 19653}]","[{'iso_3166_1': 'PH', 'name': 'Philippines'}]",2011-11-17,0.0,360.0,"[{'iso_639_1': 'tl', 'name': ''}]",Released,NaN,Century of Birthing,False,9.0,3.0
45463,False,NaN,0,"[{'id': 28, 'name': 'Action'}, {'id': 18, 'nam...",NaN,67758,tt0303758,en,Betrayal,"When one of her hits goes wrong, a professiona...",0.903007,/d5bX92nDsISNhu3ZT69uHwmfCGw.jpg,"[{'name': 'American World Pictures', 'id': 6165}]","[{'iso_3166_1': 'US', 'name': 'United States o...",2003-08-01,0.0,90.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,A deadly game of wits.,Betrayal,False,3.8,6.0
45464,False,NaN,0,[],NaN,227506,tt0008536,en,Satana likuyushchiy,"In a small town live two brothers, one a minis...",0.003503,/aorBPO7ak8e8iJKT5OcqYxU3jlK.jpg,"[{'name': 'Yermoliev', 'id': 88753}]","[{'iso_3166_1': 'RU', 'name': 'Russia'}]",1917-10-21,0.0,87.0,[],Released,NaN,Satan Triumphant,False,0.0,0.0
45465,False,NaN,0,[],NaN,461257,tt6980792,en,Queerama,50 years after decriminalisation of homosexual...,0.163015,/s5UkZt6NTsrS7ZF0Rh8nzupRlIU.jpg,[],"[{'iso_3166_1': 'GB', 'name': 'United Kingdom'}]",2017-06-09,0.0,75.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Queerama,False,0.0,0.0

## Keywords

### Contains the movie plot keywords for our MovieLens movies.

In [14]:
df_keyword=pd.read_csv('keywords.csv')
pd.set_option('display.max_columns', None)

In [15]:
df_keyword

           id                                           keywords
0         862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1        8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2       15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3       31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4       11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...       ...                                                ...
46414  439050             [{'id': 10703, 'name': 'tragic love'}]
46415  111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
46416   67758                                                 []
46417  227506                                                 []
46418  461257                                                 []

[46419 rows x 2 columns]

In [8]:
df_keyword['keywords'][0]

"[{'id': 931, 'name': 'jealousy'}, {'id': 4290, 'name': 'toy'}, {'id': 5202, 'name': 'boy'}, {'id': 6054, 'name': 'friendship'}, {'id': 9713, 'name': 'friends'}, {'id': 9823, 'name': 'rivalry'}, {'id': 165503, 'name': 'boy next door'}, {'id': 170722, 'name': 'new toy'}, {'id': 187065, 'name': 'toy comes to life'}]"

## Ratings_small

### The subset of 100,000 ratings from 700 users on 9,000 movies.

In [206]:
df_rate = pd.read_csv('ratings_small.csv')

In [207]:
df_rate

        userId  movieId  rating   timestamp
0            1       31     2.5  1260759144
1            1     1029     3.0  1260759179
2            1     1061     3.0  1260759182
3            1     1129     2.0  1260759185
4            1     1172     4.0  1260759205
...        ...      ...     ...         ...
99999      671     6268     2.5  1065579370
100000     671     6269     4.0  1065149201
100001     671     6365     4.0  1070940363
100002     671     6385     2.5  1070979663
100003     671     6565     3.5  1074784724

[100004 rows x 4 columns]

## Links

In [10]:
df_links = pd.read_csv('links.csv')
pd.set_option('display.max_columns', None)

In [11]:
df_links

       movieId   imdbId    tmdbId
0            1   114709     862.0
1            2   113497    8844.0
2            3   113228   15602.0
3            4   114885   31357.0
4            5   113041   11862.0
...        ...      ...       ...
45838   176269  6209470  439050.0
45839   176271  2028550  111109.0
45840   176273   303758   67758.0
45841   176275     8536  227506.0
45842   176279  6980792  461257.0

[45843 rows x 3 columns]

# #####Data Cleaning

## Cast('credit.csv')

In [71]:
df_cast = df_cast_crew[['cast','id']]

In [72]:
df_cast

                                                    cast      id
0      [{'cast_id': 14, 'character': 'Woody (voice)',...     862
1      [{'cast_id': 1, 'character': 'Alan Parrish', '...    8844
2      [{'cast_id': 2, 'character': 'Max Goldman', 'c...   15602
3      [{'cast_id': 1, 'character': "Savannah 'Vannah...   31357
4      [{'cast_id': 1, 'character': 'George Banks', '...   11862
...                                                  ...     ...
45471  [{'cast_id': 0, 'character': '', 'credit_id': ...  439050
45472  [{'cast_id': 1002, 'character': 'Sister Angela...  111109
45473  [{'cast_id': 6, 'character': 'Emily Shaw', 'cr...   67758
45474  [{'cast_id': 2, 'character': '', 'credit_id': ...  227506
45475                                                 []  461257

[45476 rows x 2 columns]

In [73]:
id = df_cast['id']
# print(id)
split_1 = df_cast['cast'].str.split('},')
data = []

for index, list in enumerate(split_1):
    if list != ['[]']:
        for split in list:
            split_2 = split.split(", '") 
            # print(split_2[1])
            new_row = []
            new_row.append(id[index])
        
            for small_split in split_2:
                split_3 = small_split.split(':')
                # print(split_3)
                # print(split_3[1])
                if len(split_3) == 2:
                    new_row.append(split_3[1]) 
    #             # print(new_row)
            data.append(new_row)
            # print(new_row)
df_cast_real = pd.DataFrame(data, columns=['id', 'cast_id', 'character','credit_id', 'gender', 'unknown_id', 'name', 'order', 'profile_path'])
df_cast_real

,id,cast_id,character,credit_id,gender,unknown_id,name,order,profile_path
0,862,14,'Woody (voice)','52fe4284c3a36847f8024f95',2,31,'Tom Hanks',0,'/pQFoyx7rp09CJTAb932F2g8Nlho.jpg'
1,862,15,'Buzz Lightyear (voice)','52fe4284c3a36847f8024f99',2,12898,'Tim Allen',1,'/uX2xVf6pMmPepxnvFWyBtjexzgY.jpg'
2,862,16,'Mr. Potato Head (voice)','52fe4284c3a36847f8024f9d',2,7167,'Don Rickles',2,'/h5BcaDMPRVLHLDzbQavec4xfSdt.jpg'
3,862,17,'Slinky Dog (voice)','52fe4284c3a36847f8024fa1',2,12899,'Jim Varney',3,'/eIo2jVVXYgjDtaHoF19Ll9vtW7h.jpg'
4,862,18,'Rex (voice)','52fe4284c3a36847f8024fa5',2,12900,'Wallace Shawn',4,'/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg'
...,...,...,...,...,...,...,...,...,...
562469,227506,2,'','52fe4ea59251416c7515d7d5',2,544742,'Iwan Mosschuchin',0,None
562470,227506,3,'','52fe4ea59251416c7515d7d9',1,1090923,'Nathalie Lissenko',1,None
562471,227506,4,'','52fe4ea59251416c7515d7dd',2,1136422,'Pavel Pavlov',2,None
562472,227506,5,'','52fe4ea59251416c7515d7e1',0,1261758,'Aleksandr Chabrov',3,None
562473,227506,6,'','52fe4ea59251416c7515d7e5',1,29199,'Vera Orlova',4,'/n1NXVGNzNxtqsMWxLT1h8GO8Kpi.jpg'}]

In [74]:
df_cast_real['character'] = df_cast_real['character'].str.replace("'", "", regex=False)
df_cast_real['credit_id'] = df_cast_real['credit_id'].str.replace("'", "", regex=False)
df_cast_real['name'] = df_cast_real['name'].str.replace("'", "", regex=False)
df_cast_real['profile_path'] = df_cast_real['profile_path'].str.replace("'", "", regex=False)

In [75]:
df_cast_real

,id,cast_id,character,credit_id,gender,unknown_id,name,order,profile_path
0,862,14,Woody (voice),52fe4284c3a36847f8024f95,2,31,Tom Hanks,0,/pQFoyx7rp09CJTAb932F2g8Nlho.jpg
1,862,15,Buzz Lightyear (voice),52fe4284c3a36847f8024f99,2,12898,Tim Allen,1,/uX2xVf6pMmPepxnvFWyBtjexzgY.jpg
2,862,16,Mr. Potato Head (voice),52fe4284c3a36847f8024f9d,2,7167,Don Rickles,2,/h5BcaDMPRVLHLDzbQavec4xfSdt.jpg
3,862,17,Slinky Dog (voice),52fe4284c3a36847f8024fa1,2,12899,Jim Varney,3,/eIo2jVVXYgjDtaHoF19Ll9vtW7h.jpg
4,862,18,Rex (voice),52fe4284c3a36847f8024fa5,2,12900,Wallace Shawn,4,/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg
...,...,...,...,...,...,...,...,...,...
562469,227506,2,,52fe4ea59251416c7515d7d5,2,544742,Iwan Mosschuchin,0,None
562470,227506,3,,52fe4ea59251416c7515d7d9,1,1090923,Nathalie Lissenko,1,None
562471,227506,4,,52fe4ea59251416c7515d7dd,2,1136422,Pavel Pavlov,2,None
562472,227506,5,,52fe4ea59251416c7515d7e1,0,1261758,Aleksandr Chabrov,3,None
562473,227506,6,,52fe4ea59251416c7515d7e5,1,29199,Vera Orlova,4,/n1NXVGNzNxtqsMWxLT1h8GO8Kpi.jpg}]

In [35]:
df_cast_real.to_csv('cast.csv', index=False)

## Crew('credit.csv')

In [68]:
df_crew = df_cast_crew[['crew','id']]

NameError: name 'df_cast_crew' is not defined

In [610]:
df_crew

                                                    crew      id
0      [{'credit_id': '52fe4284c3a36847f8024f49', 'de...     862
1      [{'credit_id': '52fe44bfc3a36847f80a7cd1', 'de...    8844
2      [{'credit_id': '52fe466a9251416c75077a89', 'de...   15602
3      [{'credit_id': '52fe44779251416c91011acb', 'de...   31357
4      [{'credit_id': '52fe44959251416c75039ed7', 'de...   11862
...                                                  ...     ...
45471  [{'credit_id': '5894a97d925141426c00818c', 'de...  439050
45472  [{'credit_id': '52fe4af1c3a36847f81e9b15', 'de...  111109
45473  [{'credit_id': '52fe4776c3a368484e0c8387', 'de...   67758
45474  [{'credit_id': '533bccebc3a36844cf0011a7', 'de...  227506
45475  [{'credit_id': '593e676c92514105b702e68e', 'de...  461257

[45476 rows x 2 columns]

In [689]:
movie_id = df_cast['id']
# print(id)
data_crew = []

In [686]:
split_1 = df_crew['crew'].str.split('},')

In [690]:
for index, list in enumerate(split_1):
    if list != ['[]']:
        for split in list:
            split_2 = split.split(", '") 
            # print(split_2[1])
            new_row = []
            new_row.append(movie_id[index])
        
            for small_split in split_2:
                split_3 = small_split.split(':')
                # print(split_3)
                # print(split_3[1])
                if len(split_3) == 2:
                    new_row.append(split_3[1]) 
    #             # print(new_row)
            data_crew.append(new_row)
            # print(new_row)
df_cast_real = pd.DataFrame(data_crew, columns=['movie_id', 'credit_id', 'department','gender', 'unknown_id', 'job', 'name', 'profile_path'])
df_cast_real

,movie_id,credit_id,department,gender,unknown_id,job,name,profile_path
0,862,'52fe4284c3a36847f8024f49','Directing',2,7879,'Director','John Lasseter','/7EdqiNbr4FRjIhKHyPPdFfEEEFG.jpg'
1,862,'52fe4284c3a36847f8024f4f','Writing',2,12891,'Screenplay','Joss Whedon','/dTiVsuaTVTeGmvkhcyJvKp2A5kr.jpg'
2,862,'52fe4284c3a36847f8024f55','Writing',2,7,'Screenplay','Andrew Stanton','/pvQWsu0qc8JFQhMVJkTHuexUAa1.jpg'
3,862,'52fe4284c3a36847f8024f5b','Writing',2,12892,'Screenplay','Joel Cohen','/dAubAiZcvKFbboWlj7oXOkZnTSu.jpg'
4,862,'52fe4284c3a36847f8024f61','Writing',0,12893,'Screenplay','Alec Sokolow','/v79vlRYi94BZUQnkkyznbGUZLjT.jpg'
...,...,...,...,...,...,...,...,...
464309,67758,'52fe4776c3a368484e0c8399','Sound',0,549356,'Original Music Composer','Richard McHugh',None
464310,67758,'52fe4776c3a368484e0c839f','Camera',2,58818,'Director of Photography','João Fernandes',None}]
464311,227506,'533bccebc3a36844cf0011a7','Directing',0,1085341,'Director','Yakov Protazanov','/yyjbGdCs2ZN6IlZNCfmBWyuRDlt.jpg'
464312,227506,'58ebbc26925141281908aa0a','Production',2,1195656,'Producer','Joseph N. Ermolieff',None}]
464313,461257,'593e676c92514105b702e68e','Directing',0,1344495,'Director','Daisy Asquith',None}]

In [66]:
df_cast_real['credit_id'] = df_cast_real['credit_id'].str.replace("'", "", regex=False)
df_cast_real['department'] = df_cast_real['department'].str.replace("'", "", regex=False)
df_cast_real['job'] = df_cast_real['job'].str.replace("'", "", regex=False)
df_cast_real['name'] = df_cast_real['name'].str.replace("'", "", regex=False)
df_cast_real['profile_path'] = df_cast_real['profile_path'].str.replace("'", "", regex=False)
df_cast_real = df_cast_real.drop_duplicates()

NameError: name 'df_cast_real' is not defined

In [67]:
df_cast_real

NameError: name 'df_cast_real' is not defined

## Genres ('movie_metadata.csv')

In [394]:
df_genres = df_movie[['genres','id']]

In [395]:
df_genres

                                                  genres      id
0      [{'id': 16, 'name': 'Animation'}, {'id': 35, '...     862
1      [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...    8844
2      [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...   15602
3      [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...   31357
4                         [{'id': 35, 'name': 'Comedy'}]   11862
...                                                  ...     ...
45461  [{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...  439050
45462                      [{'id': 18, 'name': 'Drama'}]  111109
45463  [{'id': 28, 'name': 'Action'}, {'id': 18, 'nam...   67758
45464                                                 []  227506
45465                                                 []  461257

[45466 rows x 2 columns]

In [396]:
split = df_genres['genres'].str.split(', {')

In [397]:
data_genres = []
moive_id = df_movie['id']

In [398]:
for index, item in enumerate(split):
    # print(item)
    if item !=['[]']:
        # print(item)
        for split_1 in item:
            # print(split_1)
            split_2 = split_1.split(',')
            # print(split_2)
            new_row = []
            new_row.append(moive_id[index])

            # print(split_2)
            for split_3 in split_2:
                # print(split_3)
                split_4 = split_3.split(':')
                # print(split_4[1])
                new_row.append(split_4[1])
                # print(new_row)
                data_genres.append(new_row)
                
df_genres_real = pd.DataFrame(data_genres, columns=['movie_id', 'id', 'name'])  
df_genres_real

       movie_id      id           name
0           862      16   'Animation'}
1           862      16   'Animation'}
2           862      35      'Comedy'}
3           862      35      'Comedy'}
4           862   10751     'Family'}]
...         ...     ...            ...
182207    67758      28      'Action'}
182208    67758      18       'Drama'}
182209    67758      18       'Drama'}
182210    67758      53   'Thriller'}]
182211    67758      53   'Thriller'}]

[182212 rows x 3 columns]

In [399]:
df_genres_real['name'] = df_genres_real['name'].str.replace("}", "", regex=False)
df_genres_real['name'] = df_genres_real['name'].str.replace("'", "", regex=False)
df_genres_real['name'] = df_genres_real['name'].str.replace("]", "", regex=False)
df_genres_real = df_genres_real.drop_duplicates()

In [400]:
df_genres_real

       movie_id      id        name
0           862      16   Animation
2           862      35      Comedy
4           862   10751      Family
6          8844      12   Adventure
8          8844      14     Fantasy
...         ...     ...         ...
182202   439050   10751      Family
182204   111109      18       Drama
182206    67758      28      Action
182208    67758      18       Drama
182210    67758      53    Thriller

[91027 rows x 3 columns]

In [401]:
df_genres_real.to_sql('genres', engine, if_exists='replace', index=False)

91027

## Collection ('movie_metadata.csv')

In [440]:
df_collection = df_movie[['belongs_to_collection','id']].copy()
df_collection['belongs_to_collection'].fillna('unknown', inplace=True)

In [533]:
df_collection

                                   belongs_to_collection      id
0      {'id': 10194, 'name': 'Toy Story Collection', ...     862
1                                                unknown    8844
2      {'id': 119050, 'name': 'Grumpy Old Men Collect...   15602
3                                                unknown   31357
4      {'id': 96871, 'name': 'Father of the Bride Col...   11862
...                                                  ...     ...
45461                                            unknown  439050
45462                                            unknown  111109
45463                                            unknown   67758
45464                                            unknown  227506
45465                                            unknown  461257

[45466 rows x 2 columns]

In [534]:
df_collection['belongs_to_collection'][0]

"{'id': 10194, 'name': 'Toy Story Collection', 'poster_path': '/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg', 'backdrop_path': '/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}"

In [442]:
split = df_collection['belongs_to_collection'].str.split(',')

In [459]:
data_collection = []
moive_id = df_movie['id']

for index, item in enumerate(split):
    new_row = []
    new_row.append(moive_id[index])
    # print(item)
    if item != 'unknown':
        # print(item)
        for split_1 in item:
            # print(split_1)
            split_2 = split_1.split(':')
            # print(split_2)

            if len(split_2) == 2:
                new_row.append(split_2[1])
                # print(new_row)
                data_collection.append(new_row)
                
df_collection_real = pd.DataFrame(data_collection, columns=['movie_id', 'id', 'collection_name', 'poster_path', 'backdrop_path'])  
df_collection_real

,movie_id,id,collection_name,poster_path,backdrop_path
0,862,10194,'Toy Story Collection','/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg','/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}
1,862,10194,'Toy Story Collection','/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg','/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}
2,862,10194,'Toy Story Collection','/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg','/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}
3,862,10194,'Toy Story Collection','/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg','/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}
4,15602,119050,'Grumpy Old Men Collection','/nLvUdqgPgm3F85NMCii9gVFUcet.jpg','/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg'}
...,...,...,...,...,...
17860,460135,477208,'DC Super Hero Girls Collection',None,None}
17861,182030,200641,'Red Lotus Collection','/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg','/3fhHbLeO3DqdHvgHg5szs399eBb.jpg'}
17862,182030,200641,'Red Lotus Collection','/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg','/3fhHbLeO3DqdHvgHg5szs399eBb.jpg'}
17863,182030,200641,'Red Lotus Collection','/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg','/3fhHbLeO3DqdHvgHg5szs399eBb.jpg'}
17864,182030,200641,'Red Lotus Collection','/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg','/3fhHbLeO3DqdHvgHg5szs399eBb.jpg'}

In [463]:
df_collection_real['collection_name'] = df_collection_real['collection_name'].str.replace("'", "", regex=False)
df_collection_real['poster_path'] = df_collection_real['poster_path'].str.replace("'", "", regex=False)
df_collection_real['backdrop_path'] = df_collection_real['backdrop_path'].str.replace("'", "", regex=False)
df_collection_real['backdrop_path'] = df_collection_real['backdrop_path'].str.replace("}", "", regex=False)

In [464]:
df_collection_real

,movie_id,id,collection_name,poster_path,backdrop_path
0,862,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
1,862,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
2,862,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
3,862,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
4,15602,119050,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg
...,...,...,...,...,...
17860,460135,477208,DC Super Hero Girls Collection,None,None
17861,182030,200641,Red Lotus Collection,/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg,/3fhHbLeO3DqdHvgHg5szs399eBb.jpg
17862,182030,200641,Red Lotus Collection,/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg,/3fhHbLeO3DqdHvgHg5szs399eBb.jpg
17863,182030,200641,Red Lotus Collection,/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg,/3fhHbLeO3DqdHvgHg5szs399eBb.jpg
17864,182030,200641,Red Lotus Collection,/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg,/3fhHbLeO3DqdHvgHg5szs399eBb.jpg

In [535]:
# remove the duplicate row
df_collection_real = df_collection_real.drop_duplicates()

In [536]:
df_collection_real

,movie_id,id,collection_name,poster_path,backdrop_path
0,862,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
4,15602,119050,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg
8,11862,96871,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg
12,710,645,James Bond Collection,/HORpg5CSkmeQlAolx3bKMrKgfi.jpg,/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg
16,21032,117693,Balto Collection,/w0ZgH6Lgxt2bQYnf1ss74UvYftm.jpg,/9VM5LiJV0bGb1st1KyHA3cVnO2G.jpg
...,...,...,...,...,...
17845,24568,37261,The Carry On Collection,/2P0HNrYgKDvirV8RCdT1rBSJdbJ.jpg,/38tF1LJN7ULeZAuAfP7beaPMfcl.jpg
17849,19307,37261,The Carry On Collection,/2P0HNrYgKDvirV8RCdT1rBSJdbJ.jpg,/38tF1LJN7ULeZAuAfP7beaPMfcl.jpg
17853,21251,37261,The Carry On Collection,/2P0HNrYgKDvirV8RCdT1rBSJdbJ.jpg,/38tF1LJN7ULeZAuAfP7beaPMfcl.jpg
17857,460135,477208,DC Super Hero Girls Collection,None,None
17861,182030,200641,Red Lotus Collection,/yf9Eod9ANXyHTzDpAxz9ezgvlL4.jpg,/3fhHbLeO3DqdHvgHg5szs399eBb.jpg

## Production companies ('movie_metadata.csv')

In [625]:
df_company = df_movie[['id', 'production_companies']].copy()

In [626]:
df_company['production_companies'].isnull().sum()

3

In [627]:
df_company['production_companies'].fillna('unknown', inplace=True)

In [628]:
df_company['production_companies'].isnull().sum()

0

In [629]:
split = df_company['production_companies'].str.split(', {')

In [630]:
split[0]

["[{'name': 'Pixar Animation Studios', 'id': 3}]"]

In [631]:
data_company = []
moive_id = df_movie['id']

for index, item in enumerate(split):
    # print(item)
    if item !=['[]'] and item !='unknown':
        # print(item)
        for split_1 in item:
            # print(split_1)
            split_2 = split_1.split(',')
            # print(split_2)
            new_row = []
            new_row.append(moive_id[index])

            # print(split_2)
            for split_3 in split_2:
                # print(split_3)
                split_4 = split_3.split(':')
                if len(split_4) == 2:
                    # print(split_4[1])
                    new_row.append(split_4[1])
                    # print(new_row)
                    data_company.append(new_row)
                
df_company_real = pd.DataFrame(data_company, columns=['movie_id', 'company_name', 'id'])  
df_company_real

       movie_id                company_name        id
0           862   'Pixar Animation Studios'       3}]
1           862   'Pixar Animation Studios'       3}]
2          8844          'TriStar Pictures'      559}
3          8844          'TriStar Pictures'      559}
4          8844              'Teitler Film'     2550}
...         ...                         ...       ...
141076   111109               'Sine Olivia'   19653}]
141077    67758   'American World Pictures'    6165}]
141078    67758   'American World Pictures'    6165}]
141079   227506                 'Yermoliev'   88753}]
141080   227506                 'Yermoliev'   88753}]

[141081 rows x 3 columns]

In [529]:
df_company_real['company_name'] = df_company_real['company_name'].str.replace("'", "", regex=False)
df_company_real['id'] = df_company_real['id'].str.replace("}]", "", regex=False)
df_company_real['id'] = df_company_real['id'].str.replace("}", "", regex=False)

In [531]:
# remove the duplicate row
df_company_real = df_company_real.drop_duplicates()

In [532]:
df_company_real

       movie_id                    company_name      id
0           862         Pixar Animation Studios       3
2          8844                TriStar Pictures     559
4          8844                    Teitler Film    2550
6          8844       Interscope Communications   10201
8         15602                    Warner Bros.    6194
...         ...                             ...     ...
141071    30840     20th Century Fox Television   16323
141073    30840   CanWest Global Communications   38978
141075   111109                     Sine Olivia   19653
141077    67758         American World Pictures    6165
141079   227506                       Yermoliev   88753

[70464 rows x 3 columns]

## Production_countries ('movie_metadata.csv')

In [437]:
df_country = df_movie[['id','production_countries']].copy()
df_country['production_countries'][0]

"[{'iso_3166_1': 'US', 'name': 'United States of America'}]"

In [438]:
df_country['production_countries'].isnull().sum()

3

In [439]:
df_country['production_countries'].fillna('unknown', inplace=True)
df_country['production_countries'].isnull().sum()

0

In [440]:
df_country['production_countries']

0        [{'iso_3166_1': 'US', 'name': 'United States o...
1        [{'iso_3166_1': 'US', 'name': 'United States o...
2        [{'iso_3166_1': 'US', 'name': 'United States o...
3        [{'iso_3166_1': 'US', 'name': 'United States o...
4        [{'iso_3166_1': 'US', 'name': 'United States o...
                               ...
45461               [{'iso_3166_1': 'IR', 'name': 'Iran'}]
45462        [{'iso_3166_1': 'PH', 'name': 'Philippines'}]
45463    [{'iso_3166_1': 'US', 'name': 'United States o...
45464             [{'iso_3166_1': 'RU', 'name': 'Russia'}]
45465     [{'iso_3166_1': 'GB', 'name': 'United Kingdom'}]
Name: production_countries, Length: 45466, dtype: object

In [441]:
split = df_country['production_countries'].str.split(', {')

In [442]:
split[11]

["[{'iso_3166_1': 'FR', 'name': 'France'}",
 "'iso_3166_1': 'US', 'name': 'United States of America'}]"]

In [443]:
data_country = []
moive_id = df_movie['id']

for index, item in enumerate(split):
    # print(item)
    if item !=['[]'] and item !='unknown':
        # print(item)
        for split_1 in item:
            # print(split_1)
            split_2 = split_1.split(',')
            # print(split_2)
            new_row = []
            new_row.append(moive_id[index])
            
            # print(new_row)

            # print(split_2)
            for split_3 in split_2:
                # print(split_3)
                split_4 = split_3.split(':')
                # print(split_4)
                
                if len(split_4) == 2:
                    # print(split_4[1])
                    new_row.append(split_4[1])
                    # print(new_row)
                    data_country.append(new_row)
# print(data_country)                
data_country_real = pd.DataFrame(data_country, columns=['movie_id', 'iso_3166_1', 'country_name'])  
data_country_real

      movie_id iso_3166_1                   country_name
0          862       'US'   'United States of America'}]
1          862       'US'   'United States of America'}]
2         8844       'US'   'United States of America'}]
3         8844       'US'   'United States of America'}]
4        15602       'US'   'United States of America'}]
...        ...        ...                            ...
98841    67758       'US'   'United States of America'}]
98842   227506       'RU'                     'Russia'}]
98843   227506       'RU'                     'Russia'}]
98844   461257       'GB'             'United Kingdom'}]
98845   461257       'GB'             'United Kingdom'}]

[98846 rows x 3 columns]

In [444]:
data_country_real['iso_3166_1'] = data_country_real['iso_3166_1'].str.replace("'", "", regex=False)
data_country_real['country_name'] = data_country_real['country_name'].str.replace("'}]", "", regex=False)
data_country_real['country_name'] = data_country_real['country_name'].str.replace("'", "", regex=False)
data_country_real['country_name'] = data_country_real['country_name'].str.replace("}", "", regex=False)
data_country_real = data_country_real.drop_duplicates()

In [445]:
data_country_real

      movie_id iso_3166_1               country_name
0          862         US   United States of America
2         8844         US   United States of America
4        15602         US   United States of America
6        31357         US   United States of America
8        11862         US   United States of America
...        ...        ...                        ...
98836   439050         IR                       Iran
98838   111109         PH                Philippines
98840    67758         US   United States of America
98842   227506         RU                     Russia
98844   461257         GB             United Kingdom

[49368 rows x 3 columns]

In [447]:
data_country_real.to_sql('country', engine, if_exists='replace', index=False)

49368

## Spoken languages ('movie_metadata.csv')

In [37]:
df_language = df_movie[['spoken_languages','id']].copy()

In [38]:
df_language

                                        spoken_languages      id
0               [{'iso_639_1': 'en', 'name': 'English'}]     862
1      [{'iso_639_1': 'en', 'name': 'English'}, {'iso...    8844
2               [{'iso_639_1': 'en', 'name': 'English'}]   15602
3               [{'iso_639_1': 'en', 'name': 'English'}]   31357
4               [{'iso_639_1': 'en', 'name': 'English'}]   11862
...                                                  ...     ...
45461             [{'iso_639_1': 'fa', 'name': 'فارسی'}]  439050
45462                  [{'iso_639_1': 'tl', 'name': ''}]  111109
45463           [{'iso_639_1': 'en', 'name': 'English'}]   67758
45464                                                 []  227506
45465           [{'iso_639_1': 'en', 'name': 'English'}]  461257

[45466 rows x 2 columns]

In [39]:
df_language['spoken_languages'].isnull().sum()

6

In [40]:
df_language['spoken_languages'].fillna('unknown', inplace=True)
df_language['spoken_languages'].isnull().sum()

0

In [42]:
df_language

                                        spoken_languages      id
0               [{'iso_639_1': 'en', 'name': 'English'}]     862
1      [{'iso_639_1': 'en', 'name': 'English'}, {'iso...    8844
2               [{'iso_639_1': 'en', 'name': 'English'}]   15602
3               [{'iso_639_1': 'en', 'name': 'English'}]   31357
4               [{'iso_639_1': 'en', 'name': 'English'}]   11862
...                                                  ...     ...
45461             [{'iso_639_1': 'fa', 'name': 'فارسی'}]  439050
45462                  [{'iso_639_1': 'tl', 'name': ''}]  111109
45463           [{'iso_639_1': 'en', 'name': 'English'}]   67758
45464                                                 []  227506
45465           [{'iso_639_1': 'en', 'name': 'English'}]  461257

[45466 rows x 2 columns]

In [43]:
split = df_language['spoken_languages'].str.split(', {')

In [48]:
data_language = []
moive_id = df_movie['id']

for index, item in enumerate(split):
    # print(item)
    if item !=['[]'] and item !='unknown':
        # print(item)
        for split_1 in item:
            # print(split_1)
            split_2 = split_1.split(',')
            # print(split_2)
            new_row = []
            new_row.append(moive_id[index])
            
            # print(new_row)

            # print(split_2)
            for split_3 in split_2:
                # print(split_3)
                split_4 = split_3.split(':')
                # print(split_4)
                
                if len(split_4) == 2:
                    # print(split_4[1])
                    new_row.append(split_4[1])
                    # print(new_row)
                    data_language.append(new_row)
# print(data_country)                
data_language_real = pd.DataFrame(data_language, columns=['movie_id', 'iso_639_1', 'name'])  
data_language_real

       movie_id iso_639_1           name
0           862      'en'    'English'}]
1           862      'en'    'English'}]
2          8844      'en'     'English'}
3          8844      'en'     'English'}
4          8844      'fr'   'Français'}]
...         ...       ...            ...
106595   111109      'tl'           ''}]
106596    67758      'en'    'English'}]
106597    67758      'en'    'English'}]
106598   461257      'en'    'English'}]
106599   461257      'en'    'English'}]

[106600 rows x 3 columns]

In [49]:
data_language_real['iso_639_1'] = data_language_real['iso_639_1'].str.replace("'", "", regex=False)
data_language_real['name'] = data_language_real['name'].str.replace("'}]", "", regex=False)
data_language_real['name'] = data_language_real['name'].str.replace("'", "", regex=False)
data_language_real['name'] = data_language_real['name'].str.replace("}", "", regex=False)
data_language_real = data_language_real.drop_duplicates()

In [50]:
data_language_real

       movie_id iso_639_1       name
0           862        en    English
2          8844        en    English
4          8844        fr   Français
6         15602        en    English
8         31357        en    English
...         ...       ...        ...
106590    30840        en    English
106592   439050        fa      فارسی
106594   111109        tl
106596    67758        en    English
106598   461257        en    English

[53266 rows x 3 columns]

In [51]:
data_language_real.to_csv('language.csv', index=False)

## Keywords ('keyword.csv')

In [14]:
df_keyword

           id                                           keywords
0         862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1        8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2       15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3       31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4       11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...       ...                                                ...
46414  439050             [{'id': 10703, 'name': 'tragic love'}]
46415  111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
46416   67758                                                 []
46417  227506                                                 []
46418  461257                                                 []

[46419 rows x 2 columns]

In [16]:
df_keyword['keywords'][0]

"[{'id': 931, 'name': 'jealousy'}, {'id': 4290, 'name': 'toy'}, {'id': 5202, 'name': 'boy'}, {'id': 6054, 'name': 'friendship'}, {'id': 9713, 'name': 'friends'}, {'id': 9823, 'name': 'rivalry'}, {'id': 165503, 'name': 'boy next door'}, {'id': 170722, 'name': 'new toy'}, {'id': 187065, 'name': 'toy comes to life'}]"

In [17]:
df_keyword['keywords'].isnull().sum()

0

In [18]:
split = df_keyword['keywords'].str.split(', {')

In [20]:
split[0]

["[{'id': 931, 'name': 'jealousy'}",
 "'id': 4290, 'name': 'toy'}",
 "'id': 5202, 'name': 'boy'}",
 "'id': 6054, 'name': 'friendship'}",
 "'id': 9713, 'name': 'friends'}",
 "'id': 9823, 'name': 'rivalry'}",
 "'id': 165503, 'name': 'boy next door'}",
 "'id': 170722, 'name': 'new toy'}",
 "'id': 187065, 'name': 'toy comes to life'}]"]

In [26]:
data_link = []
moive_id = df_keyword['id']

for index, item in enumerate(split):
    # print(item)
    if item !=['[]']:
        # print(item)
        for split_1 in item:
            # print(split_1)
            split_2 = split_1.split(',')
            # print(split_2)
            new_row = []
            new_row.append(moive_id[index])
            
            # print(new_row)

            # print(split_2)
            for split_3 in split_2:
                # print(split_3)
                split_4 = split_3.split(':')
                # print(split_4)
                
                if len(split_4) == 2:
                    # print(split_4[1])
                    new_row.append(split_4[1])
                    # print(new_row)
                    data_link.append(new_row)
# print(data_country)                
data_link_real = pd.DataFrame(data_link, columns=['movie_id', 'keyword_id', 'name'])  
data_link_real

        movie_id keyword_id          name
0            862        931   'jealousy'}
1            862        931   'jealousy'}
2            862       4290        'toy'}
3            862       4290        'toy'}
4            862       5202        'boy'}
...          ...        ...           ...
317353    111109       2679     'artist'}
317354    111109      14531       'play'}
317355    111109      14531       'play'}
317356    111109     215397     'pinoy'}]
317357    111109     215397     'pinoy'}]

[317358 rows x 3 columns]

In [32]:
data_link_real['name'] = data_link_real['name'].str.replace("'", "", regex=False)
data_link_real['name'] = data_link_real['name'].str.replace("'}", "", regex=False)
data_link_real['name'] = data_link_real['name'].str.replace("}", "", regex=False)
data_link_real['name'] = data_link_real['name'].str.replace("]", "", regex=False)
data_link_real = data_link_real.drop_duplicates()

In [33]:
data_link_real

        movie_id keyword_id           name
0            862        931       jealousy
2            862       4290            toy
4            862       5202            boy
6            862       6054     friendship
8            862       9713        friends
...          ...        ...            ...
317348    289923      11800   mockumentary
317350    439050      10703    tragic love
317352    111109       2679         artist
317354    111109      14531           play
317356    111109     215397          pinoy

[156602 rows x 3 columns]

## Movie

In [9]:
df_movie

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92.0
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156.0,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.1,34.0
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911.0,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.7,173.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45461,False,NaN,0,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",http://www.imdb.com/title/tt6209470/,439050,tt6209470,fa,رگ خواب,Rising and falling between a man and woman.,...,NaN,0.0,90.0,"[{'iso_639_1': 'fa', 'name': 'فارسی'}]",Released,Rising and falling between a man and woman,Subdue,False,4.0,1.0
45462,False,NaN,0,"[{'id': 18, 'name': 'Drama'}]",NaN,111109,tt2028550,tl,Siglo ng Pagluluwal,An artist struggles to finish his work while a...,...,2011-11-17,0.0,360.0,"[{'iso_639_1': 'tl', 'name': ''}]",Released,NaN,Century of Birthing,False,9.0,3.0
45463,False,NaN,0,"[{'id': 28, 'name': 'Action'}, {'id': 18, 'nam...",NaN,67758,tt0303758,en,Betrayal,"When one of her hits goes wrong, a professiona...",...,2003-08-01,0.0,90.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,A deadly game of wits.,Betrayal,False,3.8,6.0
45464,False,NaN,0,[],NaN,227506,tt0008536,en,Satana likuyushchiy,"In a small town live two brothers, one a minis...",...,1917-10-21,0.0,87.0,[],Released,NaN,Satan Triumphant,False,0.0,0.0
45465,False,NaN,0,[],NaN,461257,tt6980792,en,Queerama,50 years after decriminalisation of homosexual...,...,2017-06-09,0.0,75.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Queerama,False,0.0,0.0

In [10]:
df_movie_real=df_movie[['original_title','id','overview','budget','homepage','imdb_id','original_language','poster_path','runtime']].copy()

In [11]:
df_movie_real

,original_title,id,overview,budget,homepage,imdb_id,original_language,poster_path,runtime
0,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
1,Jumanji,8844,When siblings Judy and Peter discover an encha...,65000000,NaN,tt0113497,en,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,104.0
2,Grumpier Old Men,15602,A family wedding reignites the ancient feud be...,0,NaN,tt0113228,en,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg,101.0
3,Waiting to Exhale,31357,"Cheated on, mistreated and stepped on, the wom...",16000000,NaN,tt0114885,en,/16XOMpEaLWkrcPqSQqhTmeJuqQl.jpg,127.0
4,Father of the Bride Part II,11862,Just when George Banks has recovered from his ...,0,NaN,tt0113041,en,/e64sOI48hQXyru7naBFyssKFxVd.jpg,106.0
...,...,...,...,...,...,...,...,...,...
45461,رگ خواب,439050,Rising and falling between a man and woman.,0,http://www.imdb.com/title/tt6209470/,tt6209470,fa,/jldsYflnId4tTWPx8es3uzsB1I8.jpg,90.0
45462,Siglo ng Pagluluwal,111109,An artist struggles to finish his work while a...,0,NaN,tt2028550,tl,/xZkmxsNmYXJbKVsTRLLx3pqGHx7.jpg,360.0
45463,Betrayal,67758,"When one of her hits goes wrong, a professiona...",0,NaN,tt0303758,en,/d5bX92nDsISNhu3ZT69uHwmfCGw.jpg,90.0
45464,Satana likuyushchiy,227506,"In a small town live two brothers, one a minis...",0,NaN,tt0008536,en,/aorBPO7ak8e8iJKT5OcqYxU3jlK.jpg,87.0
45465,Queerama,461257,50 years after decriminalisation of homosexual...,0,NaN,tt6980792,en,/s5UkZt6NTsrS7ZF0Rh8nzupRlIU.jpg,75.0

In [12]:
df_movie_real['imdb_id'] = df_movie_real['imdb_id'].str.replace('tt','',regex=False)

In [13]:
df_movie_real

,original_title,id,overview,budget,homepage,imdb_id,original_language,poster_path,runtime
0,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
1,Jumanji,8844,When siblings Judy and Peter discover an encha...,65000000,NaN,0113497,en,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,104.0
2,Grumpier Old Men,15602,A family wedding reignites the ancient feud be...,0,NaN,0113228,en,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg,101.0
3,Waiting to Exhale,31357,"Cheated on, mistreated and stepped on, the wom...",16000000,NaN,0114885,en,/16XOMpEaLWkrcPqSQqhTmeJuqQl.jpg,127.0
4,Father of the Bride Part II,11862,Just when George Banks has recovered from his ...,0,NaN,0113041,en,/e64sOI48hQXyru7naBFyssKFxVd.jpg,106.0
...,...,...,...,...,...,...,...,...,...
45461,رگ خواب,439050,Rising and falling between a man and woman.,0,http://www.imdb.com/title/tt6209470/,6209470,fa,/jldsYflnId4tTWPx8es3uzsB1I8.jpg,90.0
45462,Siglo ng Pagluluwal,111109,An artist struggles to finish his work while a...,0,NaN,2028550,tl,/xZkmxsNmYXJbKVsTRLLx3pqGHx7.jpg,360.0
45463,Betrayal,67758,"When one of her hits goes wrong, a professiona...",0,NaN,0303758,en,/d5bX92nDsISNhu3ZT69uHwmfCGw.jpg,90.0
45464,Satana likuyushchiy,227506,"In a small town live two brothers, one a minis...",0,NaN,0008536,en,/aorBPO7ak8e8iJKT5OcqYxU3jlK.jpg,87.0
45465,Queerama,461257,50 years after decriminalisation of homosexual...,0,NaN,6980792,en,/s5UkZt6NTsrS7ZF0Rh8nzupRlIU.jpg,75.0

In [14]:
df_movie_real.to_sql('movie', engine, if_exists='replace', index=False)

45466

## Release

In [367]:
df_release = df_movie[['id','release_date','revenue','status','tagline','title','video']]

In [368]:
df_release_copy = df_release.copy()

In [369]:
df_release_copy.dtypes

id               object
release_date     object
revenue         float64
status           object
tagline          object
title            object
video            object
dtype: object

In [370]:
df_release_copy['release_date']

0        1995-10-30
1        1995-12-15
2        1995-12-22
3        1995-12-22
4        1995-02-10
            ...
45461           NaN
45462    2011-11-17
45463    2003-08-01
45464    1917-10-21
45465    2017-06-09
Name: release_date, Length: 45466, dtype: object

In [371]:
df_release_copy['release_date'].isnull().sum()

87

In [372]:
pd.to_datetime(df_release_copy['release_date'], errors='coerce')

0       1995-10-30
1       1995-12-15
2       1995-12-22
3       1995-12-22
4       1995-02-10
           ...
45461          NaT
45462   2011-11-17
45463   2003-08-01
45464   1917-10-21
45465   2017-06-09
Name: release_date, Length: 45466, dtype: datetime64[ns]

In [373]:
df_release_copy['release_date'] = pd.to_datetime(df_release_copy['release_date'], format='%Y-%m-%d', errors='coerce')

In [374]:
df_release_copy

,id,release_date,revenue,status,tagline,title,video
0,862,1995-10-30,373554033.0,Released,NaN,Toy Story,False
1,8844,1995-12-15,262797249.0,Released,Roll the dice and unleash the excitement!,Jumanji,False
2,15602,1995-12-22,0.0,Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False
3,31357,1995-12-22,81452156.0,Released,Friends are the people who let you be yourself...,Waiting to Exhale,False
4,11862,1995-02-10,76578911.0,Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False
...,...,...,...,...,...,...,...
45461,439050,NaT,0.0,Released,Rising and falling between a man and woman,Subdue,False
45462,111109,2011-11-17,0.0,Released,NaN,Century of Birthing,False
45463,67758,2003-08-01,0.0,Released,A deadly game of wits.,Betrayal,False
45464,227506,1917-10-21,0.0,Released,NaN,Satan Triumphant,False
45465,461257,2017-06-09,0.0,Released,NaN,Queerama,False

In [375]:
df_release_copy.to_sql('release_r', engine, if_exists='replace', index=False)

45466

## Rating

In [212]:
df_rate.to_sql('rating', engine, if_exists='replace', index=False)

100004

# Use Case

### Audiences and distributors have different ways of evaluating movies. When it comes to choosing a movie to watch during leisure time, people are more concerned about the genre of the movie, whether it features their favorite actors, and how popular and well-rated it is. On the other hand, for distributors, they are more interested in understanding the annual quantity of movies, as well as the investment and profitability of each film.

## Basic features

## 1. What is the top 10 movie genres

In [7]:
cursor = mydb.cursor()
cursor.execute('SELECT * FROM genres g join movie m on g.movie_id = m.id')

# 读取所有行
rows = cursor.fetchall()
movie_genres = pd.DataFrame(rows, columns=['movid_id','genres_id','genres_name','original_title','id','overview','budget','homepage','imdb_id','original_language','poster_path','runtime'])

In [8]:
movie_genres

,movid_id,genres_id,genres_name,original_title,id,overview,budget,homepage,imdb_id,original_language,poster_path,runtime
0,862,16,Animation,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
1,862,16,Animation,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
2,862,35,Comedy,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
3,862,35,Comedy,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
4,862,10751,Family,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
...,...,...,...,...,...,...,...,...,...,...,...,...
214137,12600,16,Animation,劇場版ポケットモンスター セレビィ 時を越えた遭遇（であい）,12600,"All your favorite Pokémon characters are back,...",0,http://www.pokemon.com/us/movies/movie-pokemon...,tt0287635,ja,/bqL0PVHbQ8Jmw3Njcl38kW0CoeM.jpg,75.0
214138,12600,878,Science Fiction,劇場版ポケットモンスター セレビィ 時を越えた遭遇（であい）,12600,"All your favorite Pokémon characters are back,...",0,http://www.pokemon.com/us/movies/movie-pokemon...,tt0287635,ja,/bqL0PVHbQ8Jmw3Njcl38kW0CoeM.jpg,75.0
214139,12600,878,Science Fiction,劇場版ポケットモンスター セレビィ 時を越えた遭遇（であい）,12600,"All your favorite Pokémon characters are back,...",0,http://www.pokemon.com/us/movies/movie-pokemon...,tt0287635,ja,/bqL0PVHbQ8Jmw3Njcl38kW0CoeM.jpg,75.0
214140,12600,10751,Family,劇場版ポケットモンスター セレビィ 時を越えた遭遇（であい）,12600,"All your favorite Pokémon characters are back,...",0,http://www.pokemon.com/us/movies/movie-pokemon...,tt0287635,ja,/bqL0PVHbQ8Jmw3Njcl38kW0CoeM.jpg,75.0
214141,12600,10751,Family,劇場版ポケットモンスター セレビィ 時を越えた遭遇（であい）,12600,"All your favorite Pokémon characters are back,...",0,http://www.pokemon.com/us/movies/movie-pokemon...,tt0287635,ja,/bqL0PVHbQ8Jmw3Njcl38kW0CoeM.jpg,75.0

In [9]:
movie_genres = movie_genres.drop_duplicates()

In [10]:
movie_genres

,movid_id,genres_id,genres_name,original_title,id,overview,budget,homepage,imdb_id,original_language,poster_path,runtime
0,862,16,Animation,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
2,862,35,Comedy,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
4,862,10751,Family,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
6,8844,12,Adventure,Jumanji,8844,When siblings Judy and Peter discover an encha...,65000000,,tt0113497,en,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,104.0
8,8844,14,Fantasy,Jumanji,8844,When siblings Judy and Peter discover an encha...,65000000,,tt0113497,en,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,104.0
...,...,...,...,...,...,...,...,...,...,...,...,...
214092,83770,18,Drama,On the Road,83770,Dean and Sal are the portrait of the Beat Gene...,25000000,http://www.ontheroad-themovie.com/?lang=en,tt0337692,en,/uORuwLgdDFkA4BuU9b9nuhTkuy.jpg,137.0
214100,72391,10751,Family,Marley & Me: The Puppy Years,72391,Fall into puppy love with “the world’s worst d...,0,,tt1704614,en,/4mQCF7U07cFkHwG3GKzpbnB8DHS.jpg,86.0
214108,72391,35,Comedy,Marley & Me: The Puppy Years,72391,Fall into puppy love with “the world’s worst d...,0,,tt1704614,en,/4mQCF7U07cFkHwG3GKzpbnB8DHS.jpg,86.0
214116,72391,12,Adventure,Marley & Me: The Puppy Years,72391,Fall into puppy love with “the world’s worst d...,0,,tt1704614,en,/4mQCF7U07cFkHwG3GKzpbnB8DHS.jpg,86.0
214124,288193,99,Documentary,Warren Oates: Across the Border,288193,A retrospective of the work of the late actor ...,0,,tt0108518,en,/4lO3oW98kABLWvD3fQn33gQcGvc.jpg,54.0

In [11]:
genres_top10 = movie_genres.groupby(['genres_id','genres_name']).size().reset_index(name='count')
genres_top10 = genres_top10.sort_values(by='count', ascending=False).head(10)

In [12]:
genres_top10

   genres_id       genres_name  count
21        18             Drama  10484
24        35            Comedy   6290
13     10749           Romance   3898
27        53          Thriller   3840
23        28            Action   3280
28        80             Crime   2305
22        27            Horror   2000
18        12         Adventure   1830
29       878   Science Fiction   1406
31        99       Documentary   1257

In [25]:
# plot
# fig, ax = plt.subplots(figsize=(10,10))
fig = px.bar(genres_top10, x='genres_name', y='count', width=800, height=700)
fig.show()

## 2. What is the top 10 movie language

In [56]:
cursor = mydb.cursor()
cursor.execute('SELECT * FROM language l join movie m on l.movie_id = m.id')

# 读取所有行
rows = cursor.fetchall()
language = pd.DataFrame(rows, columns=['movid_id','iso_639_1','language_name','original_title','id','overview','budget','homepage','imdb_id','original_language','poster_path','runtime'])

In [57]:
language

,movid_id,iso_639_1,language_name,original_title,id,overview,budget,homepage,imdb_id,original_language,poster_path,runtime
0,862,en,English,Toy Story,862,"Led by Woody, Andy's toys live happily in his ...",30000000,http://toystory.disney.com/toy-story,tt0114709,en,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,81.0
1,8844,en,English,Jumanji,8844,When siblings Judy and Peter discover an encha...,65000000,,tt0113497,en,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,104.0
2,8844,fr,Français,Jumanji,8844,When siblings Judy and Peter discover an encha...,65000000,,tt0113497,en,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,104.0
3,15602,en,English,Grumpier Old Men,15602,A family wedding reignites the ancient feud be...,0,,tt0113228,en,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg,101.0
4,31357,en,English,Waiting to Exhale,31357,"Cheated on, mistreated and stepped on, the wom...",16000000,,tt0114885,en,/16XOMpEaLWkrcPqSQqhTmeJuqQl.jpg,127.0
...,...,...,...,...,...,...,...,...,...,...,...,...
62707,72391,en,English,Marley & Me: The Puppy Years,72391,Fall into puppy love with “the world’s worst d...,0,,tt1704614,en,/4mQCF7U07cFkHwG3GKzpbnB8DHS.jpg,86.0
62708,288193,en,English,Warren Oates: Across the Border,288193,A retrospective of the work of the late actor ...,0,,tt0108518,en,/4lO3oW98kABLWvD3fQn33gQcGvc.jpg,54.0
62709,288193,en,English,Warren Oates: Across the Border,288193,A retrospective of the work of the late actor ...,0,,tt0108518,en,/4lO3oW98kABLWvD3fQn33gQcGvc.jpg,54.0
62710,288193,en,English,Warren Oates: Across the Border,288193,A retrospective of the work of the late actor ...,0,,tt0108518,en,/4lO3oW98kABLWvD3fQn33gQcGvc.jpg,54.0
62711,288193,en,English,Warren Oates: Across the Border,288193,A retrospective of the work of the late actor ...,0,,tt0108518,en,/4lO3oW98kABLWvD3fQn33gQcGvc.jpg,54.0

In [61]:
language_top10 = language.groupby('language_name').size().reset_index(name='count')
language_top10 = language_top3.sort_values(by='count', ascending=False).head(10)

In [62]:
language_top10

   language_name  count
14       English  34211
17      Français   5281
15       Español   3175
12       Deutsch   3149
69           日本語   2168
22      Italiano   2136
35       Pусский   1429
70           普通话    976
33        Polski    790
34     Português    662

In [65]:
fig = px.bar(language_top10, x='language_name', y='count', width=800, height=700)
fig.show()

## 3. Who are the top10 frequent male and female actors appearing movie? How about in the top 100 movie

### (1) For the past 100 years:

In [318]:
# gender = unknown
cursor = mydb.cursor()
cursor.execute('SELECT r.release_date, c.name, c.cast_id, m.original_title, m.id, c.gender FROM cast c join movie m on c.id = m.id join release_r r on m.id = r.id where gender=0 order by release_date asc;')

rows = cursor.fetchall()
movie_cast_release_un = pd.DataFrame(rows, columns=['release_date', 'name','cast_id','original_title','id','gender'])

In [319]:
movie_cast_release_un

,release_date,name,cast_id,original_title,id,gender
0,NaT,George Thrush,3,Vermont Is for Lovers,215107,0
1,NaT,Marya Cohn,4,Vermont Is for Lovers,215107,0
2,NaT,"""Ann OBrien""",5,Vermont Is for Lovers,215107,0
3,1918-04-14,Minnie Chaplin,6,A Dog's Life,36208,0
4,1918-04-14,Syd Chaplin,7,A Dog's Life,36208,0
...,...,...,...,...,...,...
27386,2013-03-13,Marion Keller,31,Camille Claudel 1915,110428,0
27387,2013-10-12,Josh Feldman,2,The Sleepover,141210,0
27388,2013-10-12,Carolyn Jania,4,The Sleepover,141210,0
27389,2013-10-12,Kristine Blackburn,5,The Sleepover,141210,0
27390,2013-10-12,Walker Davis,6,The Sleepover,141210,0

In [320]:
movie_cr_group_unknown = movie_cast_release_un.groupby(['name','cast_id']).size().reset_index(name='count')
movie_cr_group_top10_un = movie_cr_group_unknown.sort_values(by=['count'],ascending = False).head(10)

In [321]:
movie_cr_group_top10_un

                     name cast_id  count
10297         Helen Hayes       1     11
9349        Gilbert Emery      11     10
17293        Mary Philips       4     10
2924    Blanche Friderici       9     10
24928          Tina Engel      13      9
8973     General Bergeret      14      8
10143          Harry Mann    1012      8
2643    Betty K. Peterson    1004      8
16046       Lola Gonzales    1011      8
24662        Thelma Percy    1008      8

In [322]:
# gender = 1
cursor = mydb.cursor()
cursor.execute('SELECT r.release_date, c.name, c.cast_id, m.original_title, m.id, c.gender FROM cast c join movie m on c.id = m.id join release_r r on m.id = r.id where gender=1 order by release_date asc;')

rows = cursor.fetchall()
movie_cast_release_f = pd.DataFrame(rows, columns=['release_date', 'name','cast_id','original_title','id','gender'])

In [323]:
movie_cr_group_f = movie_cast_release_f.groupby(['name','cast_id']).size().reset_index(name='count')
movie_cr_group_top10_f = movie_cr_group_f.sort_values(by=['count'],ascending = False).head(10)

In [324]:
movie_cr_group_top10_f

                     name cast_id  count
14825      Sandra Bullock       1     13
12224        Meryl Streep       1     12
11701         Mary Forbes      10     10
17097     Whoopi Goldberg       1      9
16587   Ulrike Krumbiegel      11      8
5160           Eva Mattes       8      8
3501     Corinna Harfouch       5      8
12209        Meret Becker       6      8
4116         Diane Keaton       2      8
16813     Veronica Taylor       1      7

In [325]:
# gender = 2
cursor = mydb.cursor()
cursor.execute('SELECT r.release_date, c.name, c.cast_id, m.original_title, m.id, c.gender FROM cast c join movie m on c.id = m.id join release_r r on m.id = r.id where gender=2 order by release_date asc;')

rows = cursor.fetchall()
movie_cast_release_m = pd.DataFrame(rows, columns=['release_date', 'name','cast_id','original_title','id','gender'])

In [326]:
movie_cr_group_m = movie_cast_release_m.groupby(['name','cast_id']).size().reset_index(name='count')
movie_cr_group_top10_m = movie_cr_group_m.sort_values(by=['count'],ascending = False).head(10)

In [327]:
movie_cr_group_top10_m

                  name cast_id  count
6616    Clint Eastwood       1     15
38421      Woody Allen       1     13
17250     Jeff Bridges       1     13
19925       John Wayne       1     12
19858    John Travolta       1     12
12342      Gary Cooper       2     12
24750       Mel Gibson       1     12
4607      Bruce Willis       1     11
33228     Sean Connery       1     11
31757   Robin Williams       1     11

In [328]:
#plot all movies 
fig = make_subplots(rows=1, cols=3)

fig.add_trace(go.Bar(x=movie_cr_group_top10_un['name'], y=movie_cr_group_top10_un['count'],name='Unknown_Sex'),1,1)

fig.add_trace(go.Bar(x=movie_cr_group_top10_f['name'], y=movie_cr_group_top10_f['count'],name='Female'),1,2)

fig.add_trace(go.Bar(x=movie_cr_group_top10_m['name'], y=movie_cr_group_top10_m['count'],name='Male'),1,3)

# fig.update_traces(name='unknown', showlegend = True)
fig.update_layout(title_text="Top 10 popular actor and actress over the past 100 years")
fig.show()

### (2) After 90's:

In [329]:
cursor = mydb.cursor()
cursor.execute('SELECT r.release_date, c.name, c.cast_id, m.original_title, m.id, c.gender FROM cast c join movie m on c.id = m.id join release_r r on m.id = r.id where release_date > "1990-01-01" and gender=0 order by release_date asc;')

# 读取所有行
rows = cursor.fetchall()
movie_cast_release_un = pd.DataFrame(rows, columns=['release_date', 'name','cast_id','original_title','id','gender'])

In [330]:
movie_cast_release_un

,release_date,name,cast_id,original_title,id,gender
0,1990-01-12,R.A. Mihailoff,3,Leatherface: Texas Chainsaw Massacre III,25018,0
1,1990-01-12,David Cloud,10,Leatherface: Texas Chainsaw Massacre III,25018,0
2,1990-01-12,Ron Brooks,14,Leatherface: Texas Chainsaw Massacre III,25018,0
3,1990-02-02,David Cale,25,Men Don't Leave,91217,0
4,1990-02-21,Marc Duret,2,Nikita,9322,0
...,...,...,...,...,...,...
13591,2013-03-13,Marion Keller,31,Camille Claudel 1915,110428,0
13592,2013-10-12,Josh Feldman,2,The Sleepover,141210,0
13593,2013-10-12,Carolyn Jania,4,The Sleepover,141210,0
13594,2013-10-12,Kristine Blackburn,5,The Sleepover,141210,0
13595,2013-10-12,Walker Davis,6,The Sleepover,141210,0

In [331]:
# gender = unknown
movie_cr_group_unknown = movie_cast_release_un.groupby(['name','cast_id']).size().reset_index(name='count')
movie_cr_group_top10_un = movie_cr_group_unknown.sort_values(by=['count'],ascending = False).head(10)

In [332]:
movie_cr_group_top10_un

                     name cast_id  count
12449          Tina Engel      13      8
10259       Pierre Besson      12      8
6963      Katharine Towne      25      5
7182           Kevin Dunn      14      4
1651    Brian J. Williams      75      4
12587     Tony Abatemarco      73      4
5447     James Earl Jones       3      4
9563      Nigel Hawthorne       4      3
4775         Gretchen Mol       4      3
8801           Mia Farrow       3      3

In [333]:
#gender = 1 
cursor = mydb.cursor()
cursor.execute('SELECT r.release_date, c.name, c.cast_id, m.original_title, m.id, c.gender FROM cast c join movie m on c.id = m.id join release_r r on m.id = r.id where release_date > "1990-01-01" and gender=1 order by release_date asc;')

# 读取所有行
rows = cursor.fetchall()
movie_cast_release_f = pd.DataFrame(rows, columns=['release_date', 'name','cast_id','original_title','id','gender'])

In [334]:
movie_cast_release_f

,release_date,name,cast_id,original_title,id,gender
0,1990-01-12,Kate Hodge,1,Leatherface: Texas Chainsaw Massacre III,25018,1
1,1990-01-12,Miriam Byrd-Nethery,8,Leatherface: Texas Chainsaw Massacre III,25018,1
2,1990-01-12,Jennifer Banko,9,Leatherface: Texas Chainsaw Massacre III,25018,1
3,1990-01-12,Beth DePatie,11,Leatherface: Texas Chainsaw Massacre III,25018,1
4,1990-01-12,Toni Hudson,12,Leatherface: Texas Chainsaw Massacre III,25018,1
...,...,...,...,...,...,...
11523,2011-01-01,Illeana Douglas,24,Kingdom Come,136558,1
11524,2011-01-01,Nicole Holofcener,27,Kingdom Come,136558,1
11525,2012-06-20,Geraldine James,11,The Farmer's Wife,143750,1
11526,2013-03-13,Juliette Binoche,3,Camille Claudel 1915,110428,1
11527,2013-03-13,Juliette Binoche,3,Camille Claudel 1915,110428,1

In [335]:
movie_cr_group_f = movie_cast_release_f.groupby(['name','cast_id']).size().reset_index(name='count')
movie_cr_group_top10_f = movie_cr_group_f.sort_values(by=['count'],ascending = False).head(10)

In [336]:
movie_cr_group_top10_f

                     name cast_id  count
8884       Sandra Bullock       1     13
7244         Meret Becker       6      8
10021   Ulrike Krumbiegel      11      8
3031           Eva Mattes       8      8
2106     Corinna Harfouch       5      8
10149     Veronica Taylor       1      7
10305     Whoopi Goldberg       1      6
7096             Meg Ryan       2      6
1309        Bridget Fonda       2      5
3501          Halle Berry       3      5

In [337]:
#gender = 2 
cursor = mydb.cursor()
cursor.execute('SELECT r.release_date, c.name, c.cast_id, m.original_title, m.id, c.gender FROM cast c join movie m on c.id = m.id join release_r r on m.id = r.id where release_date > "1990-01-01" and gender=2 order by release_date asc;')

# 读取所有行
rows = cursor.fetchall()
movie_cast_release_m = pd.DataFrame(rows, columns=['release_date', 'name','cast_id','original_title','id','gender'])

In [338]:
movie_cast_release_m

,release_date,name,cast_id,original_title,id,gender
0,1990-01-12,Ken Foree,2,Leatherface: Texas Chainsaw Massacre III,25018,2
1,1990-01-12,William Butler,4,Leatherface: Texas Chainsaw Massacre III,25018,2
2,1990-01-12,Viggo Mortensen,5,Leatherface: Texas Chainsaw Massacre III,25018,2
3,1990-01-12,Joe Unger,6,Leatherface: Texas Chainsaw Massacre III,25018,2
4,1990-01-12,Tom Everett,7,Leatherface: Texas Chainsaw Massacre III,25018,2
...,...,...,...,...,...,...
23581,2012-03-22,Jeff Bridges,3,A Place at the Table,84198,2
23582,2012-03-22,Tom Colicchio,4,A Place at the Table,84198,2
23583,2012-03-22,Jeff Bridges,3,A Place at the Table,84198,2
23584,2012-03-22,Tom Colicchio,4,A Place at the Table,84198,2
23585,2013-10-12,Gus Kamp,3,The Sleepover,141210,2

In [339]:
movie_cr_group_m = movie_cast_release_m.groupby(['name','cast_id']).size().reset_index(name='count')
movie_cr_group_top10_m = movie_cr_group_m.sort_values(by=['count'],ascending = False).head(10)

In [340]:
movie_cr_group_top10_m

                         name cast_id  count
10728           John Travolta       1     10
2654             Bruce Willis       1      9
7708                Hark Bohm       9      8
1129          Anthony Hopkins       1      8
1372            August Zirner       7      8
15129             Otto Sander      10      8
5886             Eddie Murphy       1      8
17461          Robin Williams       1      8
5247        Denzel Washington       1      8
9288    Jean-Claude Van Damme       1      8

In [341]:
#plot movies after 90's 
fig = make_subplots(rows=1, cols=3)

fig.add_trace(go.Bar(x=movie_cr_group_top10_un['name'], y=movie_cr_group_top10_un['count'],name='Unknown_Sex'),1,1)

fig.add_trace(go.Bar(x=movie_cr_group_top10_f['name'], y=movie_cr_group_top10_f['count'],name='Female'),1,2)

fig.add_trace(go.Bar(x=movie_cr_group_top10_m['name'], y=movie_cr_group_top10_m['count'],name='Male'),1,3)

# fig.update_traces(name='unknown', showlegend = True)
fig.update_layout(title_text="Top 10 popular actor and actress after 90's")
fig.show()

## 4. What is the average budget and revenue for each genre?

In [404]:
#join genres with movie
cursor = mydb.cursor()
cursor.execute('SELECT g.name, m.id, m.original_title, m.budget from genres g join movie m on g.movie_id = m.id where m.budget != 0;')

rows = cursor.fetchall()
genres_budget = pd.DataFrame(rows, columns=['genre', 'movie_id','movie_name','budget'])

In [405]:
genres_budget

            genre movie_id                        movie_name    budget
0       Animation      862                         Toy Story  30000000
1          Comedy      862                         Toy Story  30000000
2          Family      862                         Toy Story  30000000
3       Adventure     8844                           Jumanji  65000000
4         Fantasy     8844                           Jumanji  65000000
...           ...      ...                               ...       ...
21850      Comedy   373247                        Down Under   2000000
21851     Romance   468707  Lauri Mäntyvaaran tuuheet ripset   1254040
21852      Comedy   468707  Lauri Mäntyvaaran tuuheet ripset   1254040
21853      Comedy   293654                        Корпоратив   2000000
21854      Comedy   100152                              Марс   2000000

[21855 rows x 4 columns]

In [416]:
genres_budget_gp = genres_budget.groupby('genre').agg({'budget':np.median}).reset_index()

In [417]:
genres_budget_gp

               genre      budget
0             Action  18000000.0
1          Adventure  26000000.0
2          Animation  25000000.0
3             Comedy  10000000.0
4              Crime  12000000.0
5        Documentary    350000.0
6              Drama   8000000.0
7             Family  28000000.0
8            Fantasy  25000000.0
9            Foreign   1836576.0
10           History  14000000.0
11            Horror   3000000.0
12             Music   8000000.0
13           Mystery  12350000.0
14           Romance   9000000.0
15   Science Fiction  12000000.0
16          TV Movie   3500000.0
17          Thriller  10000000.0
18               War  11000000.0
19           Western   7000000.0

In [412]:
#join genres with movie and release 
cursor = mydb.cursor()
cursor.execute('SELECT g.name, m.id, m.original_title, r.revenue from genres g join movie m on g.movie_id = m.id join release_r r on m.id = r.id where revenue != 0;')

# 读取所有行
rows = cursor.fetchall()
genres_revenue = pd.DataFrame(rows, columns=['genre', 'movie_id','movie_name','revenue'])

In [413]:
genres_revenue

            genre movie_id                movie_name      revenue
0       Animation      862                 Toy Story  373554033.0
1          Comedy      862                 Toy Story  373554033.0
2          Family      862                 Toy Story  373554033.0
3       Adventure     8844                   Jumanji  262797249.0
4         Fantasy     8844                   Jumanji  262797249.0
...           ...      ...                       ...          ...
18556       Drama   283552  The Light Between Oceans   25956113.0
18557       Drama   376866                    Jackie   13960394.0
18558      Comedy   266500                Dr. Cabbie     223003.0
18559       Drama   390051                 Aftermath       3451.0
18560    Thriller   390051                 Aftermath       3451.0

[18561 rows x 4 columns]

In [418]:
genres_revenue_gp = genres_revenue.groupby('genre').agg({'revenue':np.median}).reset_index()

In [419]:
genres_revenue_gp

               genre     revenue
0             Action  34997324.0
1          Adventure  62086025.0
2          Animation  63800345.0
3             Comedy  19322135.0
4              Crime  21000175.0
5        Documentary    338987.0
6              Drama  11098131.0
7             Family  59584137.5
8            Fantasy  51188430.5
9            Foreign    596895.5
10           History  20173742.0
11            Horror  14796236.0
12             Music  12299668.0
13           Mystery  19725192.0
14           Romance  13269963.0
15   Science Fiction  33463969.0
16          TV Movie  42000000.0
17          Thriller  21862845.0
18               War  20208281.5
19           Western  11000000.0

In [421]:
#plot movies after 90's 
fig = make_subplots(rows=1, cols=2)

fig.add_trace(go.Bar(x=genres_budget_gp['genre'], y=genres_budget_gp['budget'],name='budget'),1,1)

fig.add_trace(go.Bar(x=genres_revenue_gp['genre'], y=genres_revenue_gp['revenue'],name='revenue'),1,2)

# fig.update_traces(name='unknown', showlegend = True)
fig.update_layout(title_text="budget vs revenue")
fig.show()

## 5. Movie production quantity by region

In [17]:
#join country with movie
cursor = mydb.cursor()
cursor.execute('SELECT c.iso_3166_1, c.country_name, m.id, m.original_title from country c join movie m on c.movie_id = m.id;')

rows = cursor.fetchall()
movie_country = pd.DataFrame(rows, columns=['iso_3166_1', 'country_name', 'movie_id','original_title'])

In [18]:
movie_country

,iso_3166_1,country_name,movie_id,original_title
0,US,United States of America,862,Toy Story
1,US,United States of America,8844,Jumanji
2,US,United States of America,15602,Grumpier Old Men
3,US,United States of America,31357,Waiting to Exhale
4,US,United States of America,11862,Father of the Bride Part II
...,...,...,...,...
49418,PL,Poland,182981,Nude Area
49419,AR,Argentina,374764,Cómo funcionan casi todas las cosas
49420,FI,Finland,468707,Lauri Mäntyvaaran tuuheet ripset
49421,RU,Russia,293654,Корпоратив
49422,RU,Russia,227506,Satana likuyushchiy

In [25]:
movie_country_gp = movie_country.groupby('iso_3166_1').size().reset_index(name='count')

In [27]:
movie_country_gp = movie_country_gp.sort_values(by=['count'],ascending = False)

In [28]:
movie_country_gp

    iso_3166_1  count
150         US  21153
51          GB   4094
50          FR   3940
40          DE   2254
69          IT   2169
..         ...    ...
18          BM      1
19          BN      1
28          CG      1
114         PF      1
59          HN      1

[161 rows x 2 columns]

In [30]:
iso_3 = pd.read_csv('countries_codes_and_coordinates.csv')

In [40]:
iso_3_copy = iso_3[['Country','Alpha-2 code','Alpha-3 code']]

In [41]:
iso_3_copy

               Country Alpha-2 code Alpha-3 code
0          Afghanistan         "AF"        "AFG"
1              Albania         "AL"        "ALB"
2              Algeria         "DZ"        "DZA"
3       American Samoa         "AS"        "ASM"
4              Andorra         "AD"        "AND"
..                 ...          ...          ...
251  Wallis and Futuna         "WF"        "WLF"
252     Western Sahara         "EH"        "ESH"
253              Yemen         "YE"        "YEM"
254             Zambia         "ZM"        "ZMB"
255           Zimbabwe         "ZW"        "ZWE"

[256 rows x 3 columns]

In [42]:
iso_3_copy['Alpha-2 code'] = iso_3_copy['Alpha-2 code'].str.replace('"', '', regex=False)
iso_3_copy['Alpha-3 code'] = iso_3_copy['Alpha-3 code'].str.replace('"', '', regex=False)

In [43]:
iso_3_copy

               Country Alpha-2 code Alpha-3 code
0          Afghanistan           AF          AFG
1              Albania           AL          ALB
2              Algeria           DZ          DZA
3       American Samoa           AS          ASM
4              Andorra           AD          AND
..                 ...          ...          ...
251  Wallis and Futuna           WF          WLF
252     Western Sahara           EH          ESH
253              Yemen           YE          YEM
254             Zambia           ZM          ZMB
255           Zimbabwe           ZW          ZWE

[256 rows x 3 columns]

In [173]:
#get iso_3
merged_iso3 = movie_country_gp.merge(iso_3_copy, left_on='iso_3166_1',right_on='Alpha-2 code')

In [179]:
merged_iso3['Alpha-3 code']=merged_iso3['Alpha-3 code'].str.strip()

In [180]:
world

            ADMIN ISO_A3                                           geometry
0           Aruba    ABW  POLYGON ((-69.99694 12.57758, -69.93639 12.531...
1     Afghanistan    AFG  POLYGON ((71.04980 38.40866, 71.05714 38.40903...
2          Angola    AGO  MULTIPOLYGON (((11.73752 -16.69258, 11.73851 -...
3        Anguilla    AIA  MULTIPOLYGON (((-63.03767 18.21296, -63.09952 ...
4         Albania    ALB  POLYGON ((19.74777 42.57890, 19.74601 42.57993...
..            ...    ...                                                ...
250         Samoa    WSM  MULTIPOLYGON (((-171.57002 -13.93816, -171.564...
251         Yemen    YEM  MULTIPOLYGON (((53.30824 12.11839, 53.31027 12...
252  South Africa    ZAF  MULTIPOLYGON (((37.86378 -46.94085, 37.83644 -...
253        Zambia    ZMB  POLYGON ((31.11984 -8.61663, 31.14102 -8.60619...
254      Zimbabwe    ZWE  POLYGON ((30.01065 -15.64623, 30.05024 -15.640...

[255 rows x 3 columns]

In [182]:
merged_iso3.loc[merged_iso3['Alpha-3 code'] == 'USA']

  iso_3166_1  count        Country Alpha-2 code Alpha-3 code
0         US  21153  United States           US          USA

In [183]:
#join with geojson file
world_join=world.merge(merged_iso3, left_on='ISO_A3', right_on='Alpha-3 code')

In [184]:
world_join

,ADMIN,ISO_A3,geometry,iso_3166_1,count,Country,Alpha-2 code,Alpha-3 code
0,Aruba,ABW,"POLYGON ((-69.99694 12.57758, -69.93639 12.531...",AW,6,Aruba,AW,ABW
1,Afghanistan,AFG,"POLYGON ((71.04980 38.40866, 71.05714 38.40903...",AF,8,Afghanistan,AF,AFG
2,Angola,AGO,"MULTIPOLYGON (((11.73752 -16.69258, 11.73851 -...",AO,3,Angola,AO,AGO
3,Albania,ALB,"POLYGON ((19.74777 42.57890, 19.74601 42.57993...",AL,5,Albania,AL,ALB
4,United Arab Emirates,ARE,"MULTIPOLYGON (((53.86305 24.23469, 53.88860 24...",AE,27,United Arab Emirates,AE,ARE
...,...,...,...,...,...,...,...,...
159,Vietnam,VNM,"MULTIPOLYGON (((106.66871 8.75349, 106.66586 8...",VN,10,Viet Nam,VN,VNM
160,Vietnam,VNM,"MULTIPOLYGON (((106.66871 8.75349, 106.66586 8...",VN,10,Vietnam,VN,VNM
161,Samoa,WSM,"MULTIPOLYGON (((-171.57002 -13.93816, -171.564...",WS,1,Samoa,WS,WSM
162,South Africa,ZAF,"MULTIPOLYGON (((37.86378 -46.94085, 37.83644 -...",ZA,125,South Africa,ZA,ZAF
163,Zimbabwe,ZWE,"POLYGON ((30.01065 -15.64623, 30.05024 -15.640...",ZW,3,Zimbabwe,ZW,ZWE

In [204]:
#plot high price heatmap
fig = px.choropleth_mapbox(world_join, geojson=world, locations='ISO_A3', color='count',
                           # color_continuous_scale="Viridis",
                           featureidkey="properties.ISO_A3",
                           mapbox_style="carto-positron",
                           zoom=1.3, center = {"lat": 24.504186, "lon":  -169.308871},
                           opacity=1,
                           labels={'Count':'count'},
                           width=2000,
                           height=800)

# fig.update_layout(margin={"r":0,"t":0,"l":0,"b":0})
fig.show()

In [189]:
import plotly.express as px
import geopandas as gpd

df = px.data.election()
geo_df = gpd.GeoDataFrame.from_features(
    px.data.election_geojson()["features"]
).merge(df, on="district").set_index("district")

fig = px.choropleth(geo_df,
                   geojson=geo_df.geometry,
                   locations=geo_df.index,
                   color="Joly",
                   projection="mercator")
fig.update_geos(fitbounds="locations", visible=False)
fig.show()

## 6. Proportion of movie durations by genres

In [115]:
#join genres with movie
cursor = mydb.cursor()
cursor.execute('SELECT g.name, m.id, m.original_title, m.runtime from genres g join movie m on g.movie_id = m.id where runtime != 0;')

rows = cursor.fetchall()
movie_runtime = pd.DataFrame(rows, columns=['genres', 'movie_id', 'movie_name','runtime'])

In [116]:
movie_runtime

           genres movie_id                        movie_name  runtime
0       Animation      862                         Toy Story     81.0
1          Comedy      862                         Toy Story     81.0
2          Family      862                         Toy Story     81.0
3       Adventure     8844                           Jumanji    104.0
4         Fantasy     8844                           Jumanji    104.0
...           ...      ...                               ...      ...
88928       Drama   182981                         Nude Area     73.0
88929     Romance   468707  Lauri Mäntyvaaran tuuheet ripset     90.0
88930      Comedy   468707  Lauri Mäntyvaaran tuuheet ripset     90.0
88931      Comedy   293654                        Корпоратив     89.0
88932      Comedy   100152                              Марс    100.0

[88933 rows x 4 columns]

In [117]:
#make category for runtime
bins = [10,30,60,120,180,360,1300]
group_order = bins
movie_runtime['runtime'] = pd.cut(movie_runtime['runtime'], bins)
movie_runtime['runtime'] = movie_runtime['runtime'].astype(str)

In [118]:
movie_runtime_real = movie_runtime.copy()
movie_runtime_real=movie_runtime_real[(movie_runtime_real['runtime'] != 'nan') & (movie_runtime_real['runtime'] != '(360, 1300]')]

In [140]:
movie_runtime_real['genres'].value_counts()

 Drama              19729
 Comedy             12514
 Thriller            7452
 Romance             6581
 Action              6437
 Horror              4559
 Crime               4219
 Documentary         3693
 Adventure           3422
 Science Fiction     2952
 Family              2639
 Mystery             2413
 Fantasy             2204
 Animation           1610
 Music               1555
 Foreign             1550
 History             1352
 War                 1292
 Western             1023
 TV Movie             724
Name: genres, dtype: int64

In [127]:
movie_runtime_real_gp=movie_runtime_real.groupby(['genres', 'runtime']).size().reset_index(name='count')

In [167]:
movie_runtime_real_gp['genres'] = movie_runtime_real_gp['genres'].str.strip()

In [168]:
plot_genres = movie_runtime_real_gp.loc[movie_runtime_real_gp['genres'] == 'Drama']

In [171]:
plot_genres

   genres     runtime  count
30  Drama    (10, 30]    129
31  Drama  (120, 180]   3090
32  Drama  (180, 360]    269
33  Drama    (30, 60]    178
34  Drama   (60, 120]  16063

In [172]:
#plot
# for i in ['Drama','Comedy','Thriller','Romance','Action','Horror','Documentary','Adventure','Science','Fiction']:
# print(i)
# plot_genres = movie_runtime_real_gp.loc[movie_runtime_real_gp['genres'] == i]
sns.set_palette('colorblind')
# category_orders=['(10, 30]','(30, 60]','(60, 120]','(120, 180]','(180, 360]']
    
fig = make_subplots(
    rows=2, cols=5,
    specs=[[
        {"type": "pie"},{"type": "pie"},{"type": "pie"},{"type": "pie"},{"type": "pie"},{"type": "pie"},{"type": "pie"},{"type": "pie"},{"type": "pie"},{"type": "pie"}]])
    
fig.add_trace(go.Pie(labels=plot_genres['runtime'], values=plot_genres['count'],title="room_house"), row=1, col=1)
    # fig.add_trace(go.Bar(x=genres_revenue_gp['genre'], y=genres_revenue_gp['revenue'],name='revenue'),1,2)

    # fig.update_traces(name='unknown', showlegend = True)
fig.update_layout(title_text="budget vs revenue")
fig.show()

ValueError:
The 'specs' argument to make_subplots must be a 2D list of dictionaries with dimensions (2 x 5).
    Received value of type <class 'list'>: [[{'type': 'pie'}, {'type': 'pie'}, {'type': 'pie'}, {'type': 'pie'}, {'type': 'pie'}, {'type': 'pie'}, {'type': 'pie'}, {'type': 'pie'}, {'type': 'pie'}, {'type': 'pie'}]]

## 2. 人们对电影的感兴趣程度（popularity, rating, keyword, 男女演员的受欢迎程度）
## 3. 电影的发行情况（是否能成功发行，不同题材的popularity, revenue，哪些演员更受欢迎，评分）

## Popularity

## 2. TO AUDIENCE（the point is 哪种因素更加影响人们对电影的喜爱程度 -> 哪种电影更受人们欢迎）

## 1. Distribution of genres in top500 popular movie?

In [215]:
#join rating with movie
cursor = mydb.cursor()
cursor.execute('SELECT r.rating, m.id, m.original_title, g.name from genres g join movie m on g.movie_id = m.id join rating r on m.id = r.movieId;')

rows = cursor.fetchall()
rating_genres = pd.DataFrame(rows, columns=['rating', 'movie_id', 'movie_name','genres'])

In [219]:
rating_genres_top500 = rating_genres.sort_values(by=['rating'],ascending=False).head(500)

In [220]:
rating_genres_top500

       rating movie_id                movie_name            genres
55311     5.0      648       La belle et la bête           Fantasy
66809     5.0     1819        You, Me and Dupree            Comedy
90540     5.0      912   The Thomas Crown Affair             Crime
90541     5.0      912   The Thomas Crown Affair           Romance
66838     5.0     3176                 バトル・ロワイアル             Drama
...       ...      ...                       ...               ...
67515     5.0     3016   Dr. Jekyll and Mr. Hyde   Science Fiction
29926     5.0      349  Crustacés et coquillages            Comedy
29927     5.0      349  Crustacés et coquillages            Comedy
67482     5.0     2003       Anatomie de l'enfer             Drama
67468     5.0       73        American History X             Drama

[500 rows x 4 columns]

## 6. Which genre of movies is more popular among people (has higher ratings)?

## TO Distributor（哪种类型的电影很难发行，哪种电影商业价值最高，哪些演员商业价值更高）

## 1. Which genre of movies has higher profits?

## 2. What are the top 100 movies in terms of audience count, and what are the top 100 movies in terms of profit?

## 3. Who is the actor/actress with the highest appearance frequency among the top 100 movies in terms of profit?

## 4. Which genres have a lower distribution rate?

## 5. Does a higher budget always result in higher profits? What are the top 10 most unprofitable movies? What are the top 10 most profitable movies?

In [ ]:
### ER Diagram